Revit 2027 API
BumpmapType Enumeration
 The enumerated type representing the permitted values for the asset property "BumpmapType" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BumpmapType
Public Enumeration BumpmapType
public enum class BumpmapType
type BumpmapType
Members
Member name | Value | Description
HeightMap | 0
NormalMap | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace